# Напишите программу, в которой пользователь будет задавать две строчки, а программа - 
# определять количество вхождений одной строки в другую



def f(N):
    count = 0
    for i in range(lenght):
        if b in a[i: i + len(b)]:
            count += 1
    return print(count)


a = str(input('Введите первую строку: ' '\n'))
b = str(input('Введите вторую строку: ' '\n'))
lenght = len(a) - len(b)
f(lenght)